/**
 * //==================================================================
 * // 《剑指Offer——名企面试官精讲典型编程题》代码
 * //
 * //==================================================================
 * // 面试题65：不用加减乘除做加法
 * // 题目：写一个函数，求两个整数之和，要求在函数体内不得使用＋、－、×、÷
 * // 四则运算符号。
 */
package offer;

public class Java65_01_AddTwoNumbers {
	/** 基本思路： 第一步，各位相加不计进位；第二步，记下进位；第三步，与进位数相加 */
	public int Add(int num1,int num2) {
		while (num2!=0) {
			//不算进位，各位相加
			int temp = num1^num2;
			//得到进位数
			num2 = (num1&num2)<<1;
			//与进位数相加，即循环以上操作
			num1 = temp;
		}
		return num1;
	}
}